PROCEDURE DIVISION.
MAIN-PROCEDURE.
    PERFORM INIT-SEED.
    PERFORM GENERATE-RANDOM-NUM.
    PERFORM SORTING-ARRAY.
    GOBACK.
    INIT-SEED SECTION.
    MOVE FUNCTION RANDOM(FUNCTION SECONDS-PAST-MIDNIGHT) TO SEED.
    GENERATE-RANDOM-NUM SECTION.
    PERFORM VARYING W-I FROM 1 BY 1 UNTIL W-I > W-LEN-ARR
     PERFORM W-LEN-ARR TIMES
       COMPUTE W-RAN-NUM = FUNCTION RANDOM *
                     (W-MAX-NUM - W-MIN-NUM + 1) +
                      W-MIN-NUM
       END-PERFORM
       MOVE W-RAN-NUM TO W-ARR(W-I)
       DISPLAY 'Unsorted: ' W-ARR(W-I)
     END-PERFORM.
    SORTING-ARRAY SECTION.
    PERFORM VARYING W-J FROM 1 BY 1 UNTIL W-J > W-LEN-ARR
      PERFORM VARYING W-K FROM 1 BY 1 UNTIL W-K >= W-LEN-ARR
        IF(W-ARR(W-K) > W-ARR(W-K + 1))
          MOVE W-ARR(W-K) TO W-TEMP
          MOVE W-ARR(W-K + 1) TO W-ARR(W-K)
          MOVE W-TEMP TO W-ARR(W-K + 1)
        END-IF
      END-PERFORM
    END-PERFORM
    PERFORM VARYING W-H FROM 1 BY 1 UNTIL W-H > W-LEN-ARR
    DISPLAY 'Sorted: ' W-ARR(W-H)
    END-PERFORM.